//---------------------------------------------------------------------------
#ifndef Unit2H
#define Unit2H
#include <string.h>
#define UNDEFINED '-'
#define CHECK 1
#define DELETE 2
#define ISHERE 3
//---------------------------------------------------------------------------
/*
    На початку рядка знаходиться кількість биків та корів,
    потім елементи множини до \0
*/
char GetFound(const char *Row); // Row!=NULL
char* Union(const char *Row1,const char *Row2); // об'єднання
char* Intersection(const char *Row1,const char *Row2); // перетин
int GetCount(const char *Row);
char* Sub(const char *Row1,const char *Row2); // Row1-Row2
//---------------------------------------------------------------------------
char* CheckRows(int &Do,const char *A,const char *B);
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#endif
 