//---------------------------------------------------------------------------
#pragma hdrstop
#pragma argsused
#include "Unit2.h"
#include <conio.h>
#include <windows.h>
//---------------------------------------------------------------------------
T_V Words;
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
void f1()
{
    cout<<"Меню:"<<endl;
    cout<<"0-завершити роботу"<<endl;
    cout<<"1-Меню:"<<endl;
    cout<<"2-відкрити файл"<<endl;
    cout<<"3-пошук слова"<<endl;
    cout<<"4-замінити рядок"<<endl;
    cout<<"5-додати рядок"<<endl;
    cout<<"6-видалити рядок"<<endl;
}
//---------------------------------------------------------------------------
void f2()
{
    char fname[256];
    cout<<"Відкрити файл:"<<endl;
    cout<<"Введіть назву файла:"<<endl;
    gets(fname);
    if(Words.SetFileName(fname))
    {
        cout<<"Файл відкрито."<<endl;
    }
    else
    {
        cout<<"Не знайдено файл."<<endl;
    }
}
//---------------------------------------------------------------------------
void f3()
{
    int i,n,*nr=NULL;
    char **w=NULL;
    char sw[128];
    cout<<"Пошук слова:"<<endl;
    cout<<"Введіть слово:"<<endl;
    gets(sw);
    n=Words.Search(sw,w,nr);
    cout<<"Результат пошуку:"<<endl;
    for(i=0;i<n;i++)
    {
        cout<<nr[i]<<") "<<w[i];
        delete[] w[i];
    }
    if(n==0)
    {
        cout<<"Нічого не знайдено."<<endl;
    }
    delete[] w;
    delete[] nr;
}
//---------------------------------------------------------------------------
void f4()
{
    int n;
    char buf[1024];
    cout<<"Заміна рядка:"<<endl;
    cout<<"Введіть номер рядка:"<<endl;
    cin>>n;
    cout<<"Введіть рядок:"<<endl;
    gets(buf);
    Words.ChangeRow(n,buf);
}
//---------------------------------------------------------------------------
void f5()
{
    char buf[1024];
    cout<<"Додавання рядка:"<<endl;
    cout<<"Введіть рядок:"<<endl;
    gets(buf);
    Words.Add(buf);
}
//---------------------------------------------------------------------------
void f6()
{
    int n;
    cout<<"Видалення рядка:"<<endl;
    cout<<"Введіть номер рядка:"<<endl;
    cin>>n;
    Words.DeleteRow(n);
}
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
int Consol()
{
    char b[3];
    int Do=0;
    cout<<"****************************************"<<endl<<"Введіть команду:"<<endl;
    scanf("%d",&Do);
    gets(b);
    switch(Do)
    {
        case 0:
            cout<<"Завершення роботи."<<endl;
            break;
        case 1:
            f1();
            break;
        case 2:
            f2();
            break;
        case 3:
            f3();
            break;
        case 4:
            f4();
            break;
        case 5:
            f5();
            break;
        case 6:
            f6();
            break;
    }
    return Do;
}
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
int main(int argc, char* argv[])
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    f1();
    while(Consol()) {}
    getch();
    return 0;
}
//---------------------------------------------------------------------------
 