//---------------------------------------------------------------------------
#pragma hdrstop
//---------------------------------------------------------------------------
#include <stdlib.h>
#include <stdio.h>
#pragma argsused
#include <windows.h>
#include <conio.h>
int main(int argc, char* argv[])
{
    int n,b;
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);
    printf("Випадкові числа.\nВведіть максимальне ціле число ");
    scanf("%d",&n);
    getchar();
    randomize();
    printf("**************************************************\n");
    while(b)
    {
        printf("*  -випало число: _-= %d =-_                     *\n",1+random(n));
        printf("* 1- продовжити, 0- завершити роботу: ");
        scanf("%d",&b);
    }
    printf("**************************************************\nРобота програми завершена. Натисніть кнопку:");
    getch();
    return 0;
}
//---------------------------------------------------------------------------
 