//---------------------------------------------------------------------------
#ifndef OperationH
#define OperationH
#include <math.h>
#include <string.h>

#include <iostream.h>
//---------------------------------------------------------------------------
typedef void (*func)(char **,float *,char *&,float &);
//---------------------------------------------------------------------------
void _sin_(char **,float *,char *&,float &);
void _add_(char **,float *,char *&,float &);
//---------------------------------------------------------------------------
class TOperand;
//---------------------------------------------------------------------------
class TOperation
{                     // operand   operation
    public://private:
        char *Name;   // назва операції, функції
        int Priority; // пріоритет виконання (вищий виконується першим)
        int N;        // кількість операндів
        int Type;     // 0- не визначено, 1- зліва, 2- справа, 3- з обох сторін
        TOperand *Operands; // операнди
        func Func;    // функція повернення числа відповідно до операції
    public:
        TOperation();
        ~TOperation();
        void Return(char *&,float &);
};
//---------------------------------------------------------------------------
class TOperand
{
    public://private:
        char *Symbol; // змінна, буква
        float Value;  // число
        TOperation *Operation; // операція
    public:
        TOperand();
        ~TOperand();
        int isNumber();
        float GetValue();
        void Return(char *&,float &);
};
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#endif
