//---------------------------------------------------------------------------
#ifndef LabiryntHH
#define LabiryntHH
#include "MatrixH.h"
#include <vcl.h>
//---------------------------------------------------------------------------
class TLabirynt:public TMatrix
{
    private:
        int Scale;  // розмір одного квадрата
        int dN,dM;  // розмірність ігрового вікна (у квадратах)
        Graphics::TBitmap *Map;
    public:
        TLabirynt();
        ~TLabirynt();
        void MapClear();
        void Draw(int,int,TCanvas *);
        void CreatePicture(int,int,int);
        void DrawElement(int,int,int,int,int);
};
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#endif
 