//---------------------------------------------------------------------------
#ifndef GeneralFunctionH
#define GeneralFunctionH
#include <stdio.h>
//---------------------------------------------------------------------------
template <class T>
    T* Intersection(T *,int,T *,int,int &);
//---------------------------------------------------------------------------
/*чи належить елемент масиву, повертає його позицію в масиві, інакше -1*/
template <class T>
    int isBelongs(T,T *,int);
//---------------------------------------------------------------------------
template <class T>
    void swap(T &a,T &b);
//---------------------------------------------------------------------------
#endif
