//---------------------------------------------------------------------------
#ifndef Unit3H
#define Unit3H
#include <fstream.h>
#include <vcl.h>
/*
    У файлі є записи, які розділені знаком ";". Кожен запис має
    кілька даних, які між собою розділяються "&".
    Після останнього запису ставиться крапка.
*/
//---------------------------------------------------------------------------
class Words
{
    private:
        String eng,ukr;
    public:
        String getEng()const { return eng; }
        String getUkr()const { return ukr; }

        void setEng(const String &eng) { this->eng=eng; }
        void setUkr(const String &ukr) { this->ukr=ukr; }
        int init(char *line);
};
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#endif
 