//---------------------------------------------------------------------------
#ifndef TbAnimationH
#define TbAnimationH
#include <vcl.h>
#include "TbList2.h"
#include "TbUFAd.h"
//---------------------------------------------------------------------------
class TbAction // дії, зв'язані з автоматами
{
    public:
        
};
//---------------------------------------------------------------------------
class TbStage // дії над автоматом або над двома автоматами
{
    private:
        // автомати
    public:
        virtual bool Draw(TCanvas *Canvas){}
        void Next();
        void Prev();
};
//---------------------------------------------------------------------------
class TbStageIteration:public TbStage
{
    private:
        // один автомат, над яким проводиться ітерація
        TbUFAd UFA;
    public:
        virtual bool Draw(TCanvas *Canvas){}
};
//---------------------------------------------------------------------------
class TbAnimation // увесь автомат
{
    private:
        TbList2 <TbStage> Stages; // список операцій
    public:
        bool Draw(TCanvas *Canvas);
        void Next();
        void Prev();
};
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#endif
 