//---------------------------------------------------------------------------
#ifndef VectorPerformanceH
#define VectorPerformanceH
#include "T_Geometry.h"
//---------------------------------------------------------------------------
class T_Gravity
{
    protected:
        T_Vector Centre;
        float minRadius, // від центру до minRadius сила зростає від 0 до Power
              maxRadius, // від minRadius до maxRadius спадає від Power до 0
              Power; // максимальна сила (максимальна довжина вектора)
                     // Power>0 - від центру Power<0 до центру
        float Angle; // кут повороту силового вектора
    public:
        /*Конструктори та деструктори*/
        T_Gravity();
        T_Gravity(const T_Gravity &);
        T_Gravity(const T_Vector &,const float &,const float &,const float &);
        ~T_Gravity() {}
        /*********Оператори***********/
        /***********Функції***********/
        float GetmaxRadius()const { return maxRadius; }
        float GetminRadius()const { return minRadius; }
        float GetPower()const { return Power; }
        T_Vector GetPowerVector(const T_Vector &)const;
        T_Point GetCentre()const { return Centre; }
        void Do_toCentre() { Power=(Power<0)?(Power):(-Power); }
        void Do_fromCentre() { Power=(Power>0)?(Power):(-Power); }
        void Draw(TCanvas *,const TColor &)const;
        void SetRadius(const float &,const float &);
        void SetPower(const float &p) { Power=p; }
        void Interaction(T_AnyVector &)const;
};
//---------------------------------------------------------------------------
const float GravitationalConstant = 1; // гравітаційна стала
//---------------------------------------------------------------------------
float LawOfGravity(const float &m1, // маса першого тіла
                   const float &m2, // маса другого тіла
                   const float &R,  // відстань між тілами
                   const float &G   // гравітаційна стала
                   ); // Закон Всесвітнього тяжіння. Повертає силу взаємодії тіл
//---------------------------------------------------------------------------
T_Vector DoVectorAttraction(const T_Vector &From,// повертає вектор притягання
                            const T_Vector &To,  // від точки From до точки
                            const float &F      // To з силою F
                            );
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#endif
 