//---------------------------------------------------------------------------
#ifndef oT_Point3H
#define oT_Point3H
#include "T_Point3.h"
struct T_Matrix4;
//---------------------------------------------------------------------------
struct oT_Point3
{
    float c[4];
    oT_Point3() { c[0]=c[1]=c[2]=c[3]=0; }
    oT_Point3(const T_Point3 &p3) { c[0]=p3.x; c[1]=p3.y; c[2]=p3.z; c[3]=1; }
    oT_Point3(const T_Point3 &p3,const float &o)
        { c[0]=p3.x; c[1]=p3.y; c[2]=p3.z; c[3]=o; }
    oT_Point3 operator * (const T_Matrix4 &M);
    T_Point3 toT_Point3();
};
/*
    точка в просторі з одноріднимим координатами
*/
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#endif
