//---------------------------------------------------------------------------
#ifndef LanguagesH
#define LanguagesH
#include <vcl.h>
//---------------------------------------------------------------------------
const char EnglishSymbol[2][33] = {
    {
        'q','w','e','r','t','y','u','i','o','p','[',']',
        'a','s','d','f','g','h','j','k','l',';','\'',
        'z','x','c','v','b','n','m',',','.','/'
    },
    {
        'Q','W','E','R','T','Y','U','I','O','P','{','}',
        'A','S','D','F','G','H','J','K','L',':','"',
        'Z','X','C','V','B','N','M','<','>','?'
    }
};
//---------------------------------------------------------------------------
const char UkrainianSymbol[2][33] = {
    {
        'й','ц','у','к','е','н','г','ш','щ','з','х','ї',
        'ф','і','в','а','п','р','о','л','д','ж','є',
        'я','ч','с','м','и','т','ь','б','ю','.',
    },
    {
        'Й','Ц','У','К','Е','Н','Г','Ш','Щ','З','Х','Ї',
        'Ф','І','В','А','П','Р','О','Л','Д','Ж','Є',
        'Я','Ч','С','М','И','Т','Ь','Б','Ю',','
    }
};
//---------------------------------------------------------------------------
const TPoint KeyCoordinate[33] = {
    TPoint( 77, 52),TPoint(128, 52),TPoint(179, 52),
    TPoint(230, 52),TPoint(281, 52),TPoint(332, 52),
    TPoint(383, 52),TPoint(434, 52),TPoint(485, 52),
    TPoint(536, 52),TPoint(587, 52),TPoint(638, 52),
    TPoint( 89,103),TPoint(140,103),TPoint(191,103),
    TPoint(242,103),TPoint(293,103),TPoint(344,103),
    TPoint(395,103),TPoint(446,103),TPoint(497,103),
    TPoint(548,103),TPoint(599,103),TPoint(102,154),
    TPoint(153,154),TPoint(204,154),TPoint(255,154),
    TPoint(306,154),TPoint(357,154),TPoint(408,154),
    TPoint(459,154),TPoint(510,154),TPoint(561,154)
};
//---------------------------------------------------------------------------
/*
    Матриця для збереження букв, які призначені для відповідних пальців.
    Перший елемент рядка  - довжина рядка, далі - індекси у відповідний масив
    символів. Перші 5 рядків відповідають лівій руці, 5 наступних - правій.
    Для кожної руки - рух відбувається від мізинця до великого пальця, так,
    наприклад, мізинець має номер 0, а великий  - 4.
*/
const int Finger[10][8] = {
    {2,0,12},                // ліва рука   мізинець
    {3,1,13,23},             // ліва рука   безіменний
    {3,2,14,24},             // ліва рука   середній
    {7,3,4,15,16,25,26,27},  // ліва рука   вказівний
    {0},                     // ліва рука   великий
    {6,9,10,11,21,22,32},    // права рука  мізинець
    {3,8,20,31},             // права рука  безіменний
    {3,7,19,30},             // права рука  середній
    {6,5,6,17,18,28,29},     // права рука  вказівний
    {0}                      // права рука  великий
};
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#endif
