//---------------------------------------------------------------------------
#ifndef TbDetailH
#define TbDetailH
#include "T_Vector2d.h"
//---------------------------------------------------------------------------
class TbDetail // відрізок, полігон, еліпс ...
{
	private:
		TbDetail *Parent;
		TbVector2d Location;
	public:
		TbDetail(TbDetail *Parent);

		TbVector2d GetGlobalLocation()const;
        TbVector2d GetParentLocation()const;
		TbVector2d GetLocation()const;

		void SetLocation(const TbVector2d &Location);
};
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#endif
