//---------------------------------------------------------------------------
#ifndef T_MapH
#define T_MapH
#include "T_City.h"
//---------------------------------------------------------------------------
class T_Map             // загальна (уся) карта гри
{
    private:
        friend T_Commander;
    protected:
        char *Name; // назва карти
        int AllNation; // всього націй
        int KCity;  // кількість міст
        T_City **Cities; // масив міст
        int CurrentNation; // поточна нація (яка в даний час ходить)
        int CurrentCity; // поточне місто
        void NextNation();
        void NextDay(); // наступний крок (день)
    public:
        T_Map();
        T_Map(const T_Map &);
        //T_Map(char *,int,);
        ~T_Map();
        T_City* GetNextCity();
        T_City* GetCity(int);
};
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
//---------------------------------------------------------------------------
#endif
